cases/openfoam.org/fanRotationAndAMI/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ami.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}

wall.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}

rotor.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}


// ************************************************************************* //
